# UIThemeManager Methods

---
The UIThemeManager type exposes the following members.
| Name| Description
---|---|---
| GetThemeName|  Gets the theme name for the given theme type.
Top
#### Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace